# Даны два числа. Показать большее и меньшее число


a = 2
b = 10

if a > b:
    max = a
    min = b

else: 
    max = b
    min = a 

print ( "Максимальное число ", max , "Минимальное число", min)

